GopalSaraf/Practicals/PSDL/include/proc/pic16f19195.h
// Register: ALRMRPT
#define ALRMRPT ALRMRPT
extern volatile unsigned char           ALRMRPT             __at(0xC0F);
#ifndef _LIB_BUILD
asm("ALRMRPT equ 0C0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ARPT                   :8;
    };
    struct {
        unsigned ARPT0                  :1;
        unsigned ARPT1                  :1;
        unsigned ARPT2                  :1;
        unsigned ARPT3                  :1;
        unsigned ARPT4                  :1;
        unsigned ARPT5                  :1;
        unsigned ARPT6                  :1;
        unsigned ARPT7                  :1;
    };
} ALRMRPTbits_t;
extern volatile ALRMRPTbits_t ALRMRPTbits __at(0xC0F);
// bitfield macros
#define _ALRMRPT_ARPT_POSN                                  0x0
#define _ALRMRPT_ARPT_POSITION                              0x0
#define _ALRMRPT_ARPT_SIZE                                  0x8
#define _ALRMRPT_ARPT_LENGTH                                0x8
#define _ALRMRPT_ARPT_MASK                                  0xFF
#define _ALRMRPT_ARPT0_POSN                                 0x0
#define _ALRMRPT_ARPT0_POSITION                             0x0
#define _ALRMRPT_ARPT0_SIZE                                 0x1
#define _ALRMRPT_ARPT0_LENGTH                               0x1
#define _ALRMRPT_ARPT0_MASK                                 0x1
#define _ALRMRPT_ARPT1_POSN                                 0x1
#define _ALRMRPT_ARPT1_POSITION                             0x1
#define _ALRMRPT_ARPT1_SIZE                                 0x1
#define _ALRMRPT_ARPT1_LENGTH                               0x1
#define _ALRMRPT_ARPT1_MASK                                 0x2
#define _ALRMRPT_ARPT2_POSN                                 0x2
#define _ALRMRPT_ARPT2_POSITION                             0x2
#define _ALRMRPT_ARPT2_SIZE                                 0x1
#define _ALRMRPT_ARPT2_LENGTH                               0x1
#define _ALRMRPT_ARPT2_MASK                                 0x4
#define _ALRMRPT_ARPT3_POSN                                 0x3
#define _ALRMRPT_ARPT3_POSITION                             0x3
#define _ALRMRPT_ARPT3_SIZE                                 0x1
#define _ALRMRPT_ARPT3_LENGTH                               0x1
#define _ALRMRPT_ARPT3_MASK                                 0x8
#define _ALRMRPT_ARPT4_POSN                                 0x4
#define _ALRMRPT_ARPT4_POSITION                             0x4
#define _ALRMRPT_ARPT4_SIZE                                 0x1
#define _ALRMRPT_ARPT4_LENGTH                               0x1
#define _ALRMRPT_ARPT4_MASK                                 0x10
#define _ALRMRPT_ARPT5_POSN                                 0x5
#define _ALRMRPT_ARPT5_POSITION                             0x5
#define _ALRMRPT_ARPT5_SIZE                                 0x1
#define _ALRMRPT_ARPT5_LENGTH                               0x1
#define _ALRMRPT_ARPT5_MASK                                 0x20
#define _ALRMRPT_ARPT6_POSN                                 0x6
#define _ALRMRPT_ARPT6_POSITION                             0x6
#define _ALRMRPT_ARPT6_SIZE                                 0x1
#define _ALRMRPT_ARPT6_LENGTH                               0x1
#define _ALRMRPT_ARPT6_MASK                                 0x40
#define _ALRMRPT_ARPT7_POSN                                 0x7
#define _ALRMRPT_ARPT7_POSITION                             0x7
#define _ALRMRPT_ARPT7_SIZE                                 0x1
#define _ALRMRPT_ARPT7_LENGTH                               0x1
#define _ALRMRPT_ARPT7_MASK                                 0x80

// Register: YEAR
#define YEAR YEAR
extern volatile unsigned char           YEAR                __at(0xC10);
#ifndef _LIB_BUILD
asm("YEAR equ 0C10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned YEARL                  :4;
        unsigned YEARH                  :4;
    };
    struct {
        unsigned YEARL0                 :1;
        unsigned YEARL1                 :1;
        unsigned YEARL2                 :1;
        unsigned YEARL3                 :1;
        unsigned YEARH0                 :1;
        unsigned YEARH1                 :1;
        unsigned YEARH2                 :1;
        unsigned YEARH3                 :1;
    };
} YEARbits_t;
extern volatile YEARbits_t YEARbits __at(0xC10);
// bitfield macros
#define _YEAR_YEARL_POSN                                    0x0
#define _YEAR_YEARL_POSITION                                0x0
#define _YEAR_YEARL_SIZE                                    0x4
#define _YEAR_YEARL_LENGTH                                  0x4
#define _YEAR_YEARL_MASK                                    0xF
#define _YEAR_YEARH_POSN                                    0x4
#define _YEAR_YEARH_POSITION                                0x4
#define _YEAR_YEARH_SIZE                                    0x4
#define _YEAR_YEARH_LENGTH                                  0x4
#define _YEAR_YEARH_MASK                                    0xF0
#define _YEAR_YEARL0_POSN                                   0x0
#define _YEAR_YEARL0_POSITION                               0x0
#define _YEAR_YEARL0_SIZE                                   0x1
#define _YEAR_YEARL0_LENGTH                                 0x1
#define _YEAR_YEARL0_MASK                                   0x1
#define _YEAR_YEARL1_POSN                                   0x1
#define _YEAR_YEARL1_POSITION                               0x1
#define _YEAR_YEARL1_SIZE                                   0x1
#define _YEAR_YEARL1_LENGTH                                 0x1
#define _YEAR_YEARL1_MASK                                   0x2
#define _YEAR_YEARL2_POSN                                   0x2
#define _YEAR_YEARL2_POSITION                               0x2
#define _YEAR_YEARL2_SIZE                                   0x1
#define _YEAR_YEARL2_LENGTH                                 0x1
#define _YEAR_YEARL2_MASK                                   0x4
#define _YEAR_YEARL3_POSN                                   0x3
#define _YEAR_YEARL3_POSITION                               0x3
#define _YEAR_YEARL3_SIZE                                   0x1
#define _YEAR_YEARL3_LENGTH                                 0x1
#define _YEAR_YEARL3_MASK                                   0x8
#define _YEAR_YEARH0_POSN                                   0x4
#define _YEAR_YEARH0_POSITION                               0x4
#define _YEAR_YEARH0_SIZE                                   0x1
#define _YEAR_YEARH0_LENGTH                                 0x1
#define _YEAR_YEARH0_MASK                                   0x10
#define _YEAR_YEARH1_POSN                                   0x5
#define _YEAR_YEARH1_POSITION                               0x5
#define _YEAR_YEARH1_SIZE                                   0x1
#define _YEAR_YEARH1_LENGTH                                 0x1
#define _YEAR_YEARH1_MASK                                   0x20
#define _YEAR_YEARH2_POSN                                   0x6
#define _YEAR_YEARH2_POSITION                               0x6
#define _YEAR_YEARH2_SIZE                                   0x1
#define _YEAR_YEARH2_LENGTH                                 0x1
#define _YEAR_YEARH2_MASK                                   0x40
#define _YEAR_YEARH3_POSN                                   0x7
#define _YEAR_YEARH3_POSITION                               0x7
#define _YEAR_YEARH3_SIZE                                   0x1
#define _YEAR_YEARH3_LENGTH                                 0x1
#define _YEAR_YEARH3_MASK                                   0x80

