GopalSaraf/Practicals/PSDL/include/proc/pic16f19195.h
// Register: ALRMSEC
#define ALRMSEC ALRMSEC
extern volatile unsigned char           ALRMSEC             __at(0xC1C);
#ifndef _LIB_BUILD
asm("ALRMSEC equ 0C1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMLSEC               :4;
        unsigned ALRMHSEC               :3;
    };
    struct {
        unsigned ALRMLSEC0              :1;
        unsigned ALRMLSEC1              :1;
        unsigned ALRMLSEC2              :1;
        unsigned ALRMLSEC3              :1;
        unsigned ALRMHSEC0              :1;
        unsigned ALRMHSEC1              :1;
        unsigned ALRMHSEC2              :1;
    };
} ALRMSECbits_t;
extern volatile ALRMSECbits_t ALRMSECbits __at(0xC1C);
// bitfield macros
#define _ALRMSEC_ALRMLSEC_POSN                              0x0
#define _ALRMSEC_ALRMLSEC_POSITION                          0x0
#define _ALRMSEC_ALRMLSEC_SIZE                              0x4
#define _ALRMSEC_ALRMLSEC_LENGTH                            0x4
#define _ALRMSEC_ALRMLSEC_MASK                              0xF
#define _ALRMSEC_ALRMHSEC_POSN                              0x4
#define _ALRMSEC_ALRMHSEC_POSITION                          0x4
#define _ALRMSEC_ALRMHSEC_SIZE                              0x3
#define _ALRMSEC_ALRMHSEC_LENGTH                            0x3
#define _ALRMSEC_ALRMHSEC_MASK                              0x70
#define _ALRMSEC_ALRMLSEC0_POSN                             0x0
#define _ALRMSEC_ALRMLSEC0_POSITION                         0x0
#define _ALRMSEC_ALRMLSEC0_SIZE                             0x1
#define _ALRMSEC_ALRMLSEC0_LENGTH                           0x1
#define _ALRMSEC_ALRMLSEC0_MASK                             0x1
#define _ALRMSEC_ALRMLSEC1_POSN                             0x1
#define _ALRMSEC_ALRMLSEC1_POSITION                         0x1
#define _ALRMSEC_ALRMLSEC1_SIZE                             0x1
#define _ALRMSEC_ALRMLSEC1_LENGTH                           0x1
#define _ALRMSEC_ALRMLSEC1_MASK                             0x2
#define _ALRMSEC_ALRMLSEC2_POSN                             0x2
#define _ALRMSEC_ALRMLSEC2_POSITION                         0x2
#define _ALRMSEC_ALRMLSEC2_SIZE                             0x1
#define _ALRMSEC_ALRMLSEC2_LENGTH                           0x1
#define _ALRMSEC_ALRMLSEC2_MASK                             0x4
#define _ALRMSEC_ALRMLSEC3_POSN                             0x3
#define _ALRMSEC_ALRMLSEC3_POSITION                         0x3
#define _ALRMSEC_ALRMLSEC3_SIZE                             0x1
#define _ALRMSEC_ALRMLSEC3_LENGTH                           0x1
#define _ALRMSEC_ALRMLSEC3_MASK                             0x8
#define _ALRMSEC_ALRMHSEC0_POSN                             0x4
#define _ALRMSEC_ALRMHSEC0_POSITION                         0x4
#define _ALRMSEC_ALRMHSEC0_SIZE                             0x1
#define _ALRMSEC_ALRMHSEC0_LENGTH                           0x1
#define _ALRMSEC_ALRMHSEC0_MASK                             0x10
#define _ALRMSEC_ALRMHSEC1_POSN                             0x5
#define _ALRMSEC_ALRMHSEC1_POSITION                         0x5
#define _ALRMSEC_ALRMHSEC1_SIZE                             0x1
#define _ALRMSEC_ALRMHSEC1_LENGTH                           0x1
#define _ALRMSEC_ALRMHSEC1_MASK                             0x20
#define _ALRMSEC_ALRMHSEC2_POSN                             0x6
#define _ALRMSEC_ALRMHSEC2_POSITION                         0x6
#define _ALRMSEC_ALRMHSEC2_SIZE                             0x1
#define _ALRMSEC_ALRMHSEC2_LENGTH                           0x1
#define _ALRMSEC_ALRMHSEC2_MASK                             0x40

// Register: PORTG
#define PORTG PORTG
extern volatile unsigned char           PORTG               __at(0xC8C);
#ifndef _LIB_BUILD
asm("PORTG equ 0C8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG0                    :1;
        unsigned RG1                    :1;
        unsigned RG2                    :1;
        unsigned RG3                    :1;
        unsigned RG4                    :1;
        unsigned RG5                    :1;
        unsigned RG6                    :1;
        unsigned RG7                    :1;
    };
} PORTGbits_t;
extern volatile PORTGbits_t PORTGbits __at(0xC8C);
// bitfield macros
#define _PORTG_RG0_POSN                                     0x0
#define _PORTG_RG0_POSITION                                 0x0
#define _PORTG_RG0_SIZE                                     0x1
#define _PORTG_RG0_LENGTH                                   0x1
#define _PORTG_RG0_MASK                                     0x1
#define _PORTG_RG1_POSN                                     0x1
#define _PORTG_RG1_POSITION                                 0x1
#define _PORTG_RG1_SIZE                                     0x1
#define _PORTG_RG1_LENGTH                                   0x1
#define _PORTG_RG1_MASK                                     0x2
#define _PORTG_RG2_POSN                                     0x2
#define _PORTG_RG2_POSITION                                 0x2
#define _PORTG_RG2_SIZE                                     0x1
#define _PORTG_RG2_LENGTH                                   0x1
#define _PORTG_RG2_MASK                                     0x4
#define _PORTG_RG3_POSN                                     0x3
#define _PORTG_RG3_POSITION                                 0x3
#define _PORTG_RG3_SIZE                                     0x1
#define _PORTG_RG3_LENGTH                                   0x1
#define _PORTG_RG3_MASK                                     0x8
#define _PORTG_RG4_POSN                                     0x4
#define _PORTG_RG4_POSITION                                 0x4
#define _PORTG_RG4_SIZE                                     0x1
#define _PORTG_RG4_LENGTH                                   0x1
#define _PORTG_RG4_MASK                                     0x10
#define _PORTG_RG5_POSN                                     0x5
#define _PORTG_RG5_POSITION                                 0x5
#define _PORTG_RG5_SIZE                                     0x1
#define _PORTG_RG5_LENGTH                                   0x1
#define _PORTG_RG5_MASK                                     0x20
#define _PORTG_RG6_POSN                                     0x6
#define _PORTG_RG6_POSITION                                 0x6
#define _PORTG_RG6_SIZE                                     0x1
#define _PORTG_RG6_LENGTH                                   0x1
#define _PORTG_RG6_MASK                                     0x40
#define _PORTG_RG7_POSN                                     0x7
#define _PORTG_RG7_POSITION                                 0x7
#define _PORTG_RG7_SIZE                                     0x1
#define _PORTG_RG7_LENGTH                                   0x1
#define _PORTG_RG7_MASK                                     0x80

// Register: PORTH
#define PORTH PORTH
extern volatile unsigned char           PORTH               __at(0xC8D);
#ifndef _LIB_BUILD
asm("PORTH equ 0C8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH0                    :1;
        unsigned RH1                    :1;
        unsigned RH2                    :1;
        unsigned RH3                    :1;
    };
} PORTHbits_t;
extern volatile PORTHbits_t PORTHbits __at(0xC8D);
// bitfield macros
#define _PORTH_RH0_POSN                                     0x0
#define _PORTH_RH0_POSITION                                 0x0
#define _PORTH_RH0_SIZE                                     0x1
#define _PORTH_RH0_LENGTH                                   0x1
#define _PORTH_RH0_MASK                                     0x1
#define _PORTH_RH1_POSN                                     0x1
#define _PORTH_RH1_POSITION                                 0x1
#define _PORTH_RH1_SIZE                                     0x1
#define _PORTH_RH1_LENGTH                                   0x1
#define _PORTH_RH1_MASK                                     0x2
#define _PORTH_RH2_POSN                                     0x2
#define _PORTH_RH2_POSITION                                 0x2
#define _PORTH_RH2_SIZE                                     0x1
#define _PORTH_RH2_LENGTH                                   0x1
#define _PORTH_RH2_MASK                                     0x4
#define _PORTH_RH3_POSN                                     0x3
#define _PORTH_RH3_POSITION                                 0x3
#define _PORTH_RH3_SIZE                                     0x1
#define _PORTH_RH3_LENGTH                                   0x1
#define _PORTH_RH3_MASK                                     0x8

// Register: TRISG
#define TRISG TRISG
extern volatile unsigned char           TRISG               __at(0xC8E);
#ifndef _LIB_BUILD
asm("TRISG equ 0C8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISG0                 :1;
        unsigned TRISG1                 :1;
        unsigned TRISG2                 :1;
        unsigned TRISG3                 :1;
        unsigned TRISG4                 :1;
        unsigned                        :1;
        unsigned TRISG6                 :1;
        unsigned TRISG7                 :1;
    };
} TRISGbits_t;
