GopalSaraf/Practicals/PSDL/include/proc/pic16f19195.h
#define                                 RD7PPS0_bit         _BIT_ACCESS(RD7PPS,0)
// RD7PPS<RD7PPS1>
extern volatile __bit                   RD7PPS1             __at(0xF979);	// @ (0x1F2F * 8 + 1)
#define                                 RD7PPS1_bit         _BIT_ACCESS(RD7PPS,1)
// RD7PPS<RD7PPS2>
extern volatile __bit                   RD7PPS2             __at(0xF97A);	// @ (0x1F2F * 8 + 2)
#define                                 RD7PPS2_bit         _BIT_ACCESS(RD7PPS,2)
// RD7PPS<RD7PPS3>
extern volatile __bit                   RD7PPS3             __at(0xF97B);	// @ (0x1F2F * 8 + 3)
#define                                 RD7PPS3_bit         _BIT_ACCESS(RD7PPS,3)
// RD7PPS<RD7PPS4>
extern volatile __bit                   RD7PPS4             __at(0xF97C);	// @ (0x1F2F * 8 + 4)
#define                                 RD7PPS4_bit         _BIT_ACCESS(RD7PPS,4)
// RD7PPS<RD7PPS5>
extern volatile __bit                   RD7PPS5             __at(0xF97D);	// @ (0x1F2F * 8 + 5)
#define                                 RD7PPS5_bit         _BIT_ACCESS(RD7PPS,5)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// RE0PPS<RE0PPS0>
extern volatile __bit                   RE0PPS0             __at(0xF980);	// @ (0x1F30 * 8 + 0)
#define                                 RE0PPS0_bit         _BIT_ACCESS(RE0PPS,0)
// RE0PPS<RE0PPS1>
extern volatile __bit                   RE0PPS1             __at(0xF981);	// @ (0x1F30 * 8 + 1)
#define                                 RE0PPS1_bit         _BIT_ACCESS(RE0PPS,1)
// RE0PPS<RE0PPS2>
extern volatile __bit                   RE0PPS2             __at(0xF982);	// @ (0x1F30 * 8 + 2)
#define                                 RE0PPS2_bit         _BIT_ACCESS(RE0PPS,2)
// RE0PPS<RE0PPS3>
extern volatile __bit                   RE0PPS3             __at(0xF983);	// @ (0x1F30 * 8 + 3)
#define                                 RE0PPS3_bit         _BIT_ACCESS(RE0PPS,3)
// RE0PPS<RE0PPS4>
extern volatile __bit                   RE0PPS4             __at(0xF984);	// @ (0x1F30 * 8 + 4)
#define                                 RE0PPS4_bit         _BIT_ACCESS(RE0PPS,4)
// RE0PPS<RE0PPS5>
extern volatile __bit                   RE0PPS5             __at(0xF985);	// @ (0x1F30 * 8 + 5)
#define                                 RE0PPS5_bit         _BIT_ACCESS(RE0PPS,5)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// RE1PPS<RE1PPS0>
extern volatile __bit                   RE1PPS0             __at(0xF988);	// @ (0x1F31 * 8 + 0)
#define                                 RE1PPS0_bit         _BIT_ACCESS(RE1PPS,0)
// RE1PPS<RE1PPS1>
extern volatile __bit                   RE1PPS1             __at(0xF989);	// @ (0x1F31 * 8 + 1)
#define                                 RE1PPS1_bit         _BIT_ACCESS(RE1PPS,1)
// RE1PPS<RE1PPS2>
extern volatile __bit                   RE1PPS2             __at(0xF98A);	// @ (0x1F31 * 8 + 2)
#define                                 RE1PPS2_bit         _BIT_ACCESS(RE1PPS,2)
// RE1PPS<RE1PPS3>
extern volatile __bit                   RE1PPS3             __at(0xF98B);	// @ (0x1F31 * 8 + 3)
#define                                 RE1PPS3_bit         _BIT_ACCESS(RE1PPS,3)
// RE1PPS<RE1PPS4>
extern volatile __bit                   RE1PPS4             __at(0xF98C);	// @ (0x1F31 * 8 + 4)
#define                                 RE1PPS4_bit         _BIT_ACCESS(RE1PPS,4)
// RE1PPS<RE1PPS5>
extern volatile __bit                   RE1PPS5             __at(0xF98D);	// @ (0x1F31 * 8 + 5)
#define                                 RE1PPS5_bit         _BIT_ACCESS(RE1PPS,5)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// RE3PPS<RE3PPS0>
extern volatile __bit                   RE3PPS0             __at(0xF998);	// @ (0x1F33 * 8 + 0)
#define                                 RE3PPS0_bit         _BIT_ACCESS(RE3PPS,0)
// RE3PPS<RE3PPS1>
extern volatile __bit                   RE3PPS1             __at(0xF999);	// @ (0x1F33 * 8 + 1)
#define                                 RE3PPS1_bit         _BIT_ACCESS(RE3PPS,1)
// RE3PPS<RE3PPS2>
extern volatile __bit                   RE3PPS2             __at(0xF99A);	// @ (0x1F33 * 8 + 2)
#define                                 RE3PPS2_bit         _BIT_ACCESS(RE3PPS,2)
// RE3PPS<RE3PPS3>
extern volatile __bit                   RE3PPS3             __at(0xF99B);	// @ (0x1F33 * 8 + 3)
#define                                 RE3PPS3_bit         _BIT_ACCESS(RE3PPS,3)
// RE3PPS<RE3PPS4>
extern volatile __bit                   RE3PPS4             __at(0xF99C);	// @ (0x1F33 * 8 + 4)
#define                                 RE3PPS4_bit         _BIT_ACCESS(RE3PPS,4)
// RE3PPS<RE3PPS5>
extern volatile __bit                   RE3PPS5             __at(0xF99D);	// @ (0x1F33 * 8 + 5)
#define                                 RE3PPS5_bit         _BIT_ACCESS(RE3PPS,5)
// PORTE<RE4>
extern volatile __bit                   RE4                 __at(0x84);	// @ (0x10 * 8 + 4)
#define                                 RE4_bit             _BIT_ACCESS(PORTE,4)
// RE4PPS<RE4PPS0>
extern volatile __bit                   RE4PPS0             __at(0xF9A0);	// @ (0x1F34 * 8 + 0)
#define                                 RE4PPS0_bit         _BIT_ACCESS(RE4PPS,0)
// RE4PPS<RE4PPS1>
extern volatile __bit                   RE4PPS1             __at(0xF9A1);	// @ (0x1F34 * 8 + 1)
#define                                 RE4PPS1_bit         _BIT_ACCESS(RE4PPS,1)
// RE4PPS<RE4PPS2>
extern volatile __bit                   RE4PPS2             __at(0xF9A2);	// @ (0x1F34 * 8 + 2)
#define                                 RE4PPS2_bit         _BIT_ACCESS(RE4PPS,2)
// RE4PPS<RE4PPS3>
extern volatile __bit                   RE4PPS3             __at(0xF9A3);	// @ (0x1F34 * 8 + 3)
#define                                 RE4PPS3_bit         _BIT_ACCESS(RE4PPS,3)
// RE4PPS<RE4PPS4>
extern volatile __bit                   RE4PPS4             __at(0xF9A4);	// @ (0x1F34 * 8 + 4)
#define                                 RE4PPS4_bit         _BIT_ACCESS(RE4PPS,4)
// RE4PPS<RE4PPS5>
extern volatile __bit                   RE4PPS5             __at(0xF9A5);	// @ (0x1F34 * 8 + 5)
#define                                 RE4PPS5_bit         _BIT_ACCESS(RE4PPS,5)
// PORTE<RE5>
extern volatile __bit                   RE5                 __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 RE5_bit             _BIT_ACCESS(PORTE,5)
// RE5PPS<RE5PPS0>
extern volatile __bit                   RE5PPS0             __at(0xF9A8);	// @ (0x1F35 * 8 + 0)
#define                                 RE5PPS0_bit         _BIT_ACCESS(RE5PPS,0)
// RE5PPS<RE5PPS1>
extern volatile __bit                   RE5PPS1             __at(0xF9A9);	// @ (0x1F35 * 8 + 1)
#define                                 RE5PPS1_bit         _BIT_ACCESS(RE5PPS,1)
// RE5PPS<RE5PPS2>
extern volatile __bit                   RE5PPS2             __at(0xF9AA);	// @ (0x1F35 * 8 + 2)
#define                                 RE5PPS2_bit         _BIT_ACCESS(RE5PPS,2)
// RE5PPS<RE5PPS3>
extern volatile __bit                   RE5PPS3             __at(0xF9AB);	// @ (0x1F35 * 8 + 3)
#define                                 RE5PPS3_bit         _BIT_ACCESS(RE5PPS,3)
// RE5PPS<RE5PPS4>
extern volatile __bit                   RE5PPS4             __at(0xF9AC);	// @ (0x1F35 * 8 + 4)
#define                                 RE5PPS4_bit         _BIT_ACCESS(RE5PPS,4)
// RE5PPS<RE5PPS5>
extern volatile __bit                   RE5PPS5             __at(0xF9AD);	// @ (0x1F35 * 8 + 5)
#define                                 RE5PPS5_bit         _BIT_ACCESS(RE5PPS,5)
// PORTE<RE6>
extern volatile __bit                   RE6                 __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// RE6PPS<RE6PPS0>
extern volatile __bit                   RE6PPS0             __at(0xF9B0);	// @ (0x1F36 * 8 + 0)
#define                                 RE6PPS0_bit         _BIT_ACCESS(RE6PPS,0)
// RE6PPS<RE6PPS1>
extern volatile __bit                   RE6PPS1             __at(0xF9B1);	// @ (0x1F36 * 8 + 1)
#define                                 RE6PPS1_bit         _BIT_ACCESS(RE6PPS,1)
// RE6PPS<RE6PPS2>
extern volatile __bit                   RE6PPS2             __at(0xF9B2);	// @ (0x1F36 * 8 + 2)
#define                                 RE6PPS2_bit         _BIT_ACCESS(RE6PPS,2)
// RE6PPS<RE6PPS3>
extern volatile __bit                   RE6PPS3             __at(0xF9B3);	// @ (0x1F36 * 8 + 3)
#define                                 RE6PPS3_bit         _BIT_ACCESS(RE6PPS,3)
// RE6PPS<RE6PPS4>
extern volatile __bit                   RE6PPS4             __at(0xF9B4);	// @ (0x1F36 * 8 + 4)
#define                                 RE6PPS4_bit         _BIT_ACCESS(RE6PPS,4)
// RE6PPS<RE6PPS5>
extern volatile __bit                   RE6PPS5             __at(0xF9B5);	// @ (0x1F36 * 8 + 5)
#define                                 RE6PPS5_bit         _BIT_ACCESS(RE6PPS,5)
// PORTE<RE7>
extern volatile __bit                   RE7                 __at(0x87);	// @ (0x10 * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// RE7PPS<RE7PPS0>
extern volatile __bit                   RE7PPS0             __at(0xF9B8);	// @ (0x1F37 * 8 + 0)
#define                                 RE7PPS0_bit         _BIT_ACCESS(RE7PPS,0)
// RE7PPS<RE7PPS1>
extern volatile __bit                   RE7PPS1             __at(0xF9B9);	// @ (0x1F37 * 8 + 1)
#define                                 RE7PPS1_bit         _BIT_ACCESS(RE7PPS,1)
// RE7PPS<RE7PPS2>
extern volatile __bit                   RE7PPS2             __at(0xF9BA);	// @ (0x1F37 * 8 + 2)
#define                                 RE7PPS2_bit         _BIT_ACCESS(RE7PPS,2)
// RE7PPS<RE7PPS3>
extern volatile __bit                   RE7PPS3             __at(0xF9BB);	// @ (0x1F37 * 8 + 3)
#define                                 RE7PPS3_bit         _BIT_ACCESS(RE7PPS,3)
// RE7PPS<RE7PPS4>
extern volatile __bit                   RE7PPS4             __at(0xF9BC);	// @ (0x1F37 * 8 + 4)
#define                                 RE7PPS4_bit         _BIT_ACCESS(RE7PPS,4)
// RE7PPS<RE7PPS5>
extern volatile __bit                   RE7PPS5             __at(0xF9BD);	// @ (0x1F37 * 8 + 5)
#define                                 RE7PPS5_bit         _BIT_ACCESS(RE7PPS,5)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// CWG1AS0<REN>
extern volatile __bit                   REN                 __at(0x3096);	// @ (0x612 * 8 + 6)
#define                                 REN_bit             _BIT_ACCESS(CWG1AS0,6)
// SMT1CON1<REPEAT>
extern volatile __bit                   REPEAT              __at(0x24CE);	// @ (0x499 * 8 + 6)
#define                                 REPEAT_bit          _BIT_ACCESS(SMT1CON1,6)
// ADRESL<RES0>
extern volatile __bit                   RES0                __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 RES0_bit            _BIT_ACCESS(ADRESL,0)
// ADRESL<RES1>
extern volatile __bit                   RES1                __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 RES1_bit            _BIT_ACCESS(ADRESL,1)
// ADRESH<RES10>
extern volatile __bit                   RES10               __at(0x4F2);	// @ (0x9E * 8 + 2)
#define                                 RES10_bit           _BIT_ACCESS(ADRESH,2)
// ADRESH<RES11>
extern volatile __bit                   RES11               __at(0x4F3);	// @ (0x9E * 8 + 3)
#define                                 RES11_bit           _BIT_ACCESS(ADRESH,3)
// ADRESH<RES12>
extern volatile __bit                   RES12               __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 RES12_bit           _BIT_ACCESS(ADRESH,4)
// ADRESH<RES13>
extern volatile __bit                   RES13               __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 RES13_bit           _BIT_ACCESS(ADRESH,5)
// ADRESH<RES14>
extern volatile __bit                   RES14               __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 RES14_bit           _BIT_ACCESS(ADRESH,6)
// ADRESH<RES15>
extern volatile __bit                   RES15               __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 RES15_bit           _BIT_ACCESS(ADRESH,7)
// ADRESL<RES2>
extern volatile __bit                   RES2                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 RES2_bit            _BIT_ACCESS(ADRESL,2)
// ADRESL<RES3>
extern volatile __bit                   RES3                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 RES3_bit            _BIT_ACCESS(ADRESL,3)
// ADRESL<RES4>
extern volatile __bit                   RES4                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 RES4_bit            _BIT_ACCESS(ADRESL,4)
// ADRESL<RES5>
extern volatile __bit                   RES5                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 RES5_bit            _BIT_ACCESS(ADRESL,5)
// ADRESL<RES6>
extern volatile __bit                   RES6                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 RES6_bit            _BIT_ACCESS(ADRESL,6)
// ADRESL<RES7>
extern volatile __bit                   RES7                __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 RES7_bit            _BIT_ACCESS(ADRESL,7)
// ADRESH<RES8>
extern volatile __bit                   RES8                __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 RES8_bit            _BIT_ACCESS(ADRESH,0)
// ADRESH<RES9>
extern volatile __bit                   RES9                __at(0x4F1);	// @ (0x9E * 8 + 1)
#define                                 RES9_bit            _BIT_ACCESS(ADRESH,1)
// PORTF<RF0>
extern volatile __bit                   RF0                 __at(0x88);	// @ (0x11 * 8 + 0)
#define                                 RF0_bit             _BIT_ACCESS(PORTF,0)
// RF0PPS<RF0PPS0>
extern volatile __bit                   RF0PPS0             __at(0xF1C0);	// @ (0x1E38 * 8 + 0)
#define                                 RF0PPS0_bit         _BIT_ACCESS(RF0PPS,0)
// RF0PPS<RF0PPS1>
extern volatile __bit                   RF0PPS1             __at(0xF1C1);	// @ (0x1E38 * 8 + 1)
#define                                 RF0PPS1_bit         _BIT_ACCESS(RF0PPS,1)
// RF0PPS<RF0PPS2>
extern volatile __bit                   RF0PPS2             __at(0xF1C2);	// @ (0x1E38 * 8 + 2)
#define                                 RF0PPS2_bit         _BIT_ACCESS(RF0PPS,2)
// RF0PPS<RF0PPS3>
extern volatile __bit                   RF0PPS3             __at(0xF1C3);	// @ (0x1E38 * 8 + 3)
#define                                 RF0PPS3_bit         _BIT_ACCESS(RF0PPS,3)
// RF0PPS<RF0PPS4>
extern volatile __bit                   RF0PPS4             __at(0xF1C4);	// @ (0x1E38 * 8 + 4)
#define                                 RF0PPS4_bit         _BIT_ACCESS(RF0PPS,4)
// RF0PPS<RF0PPS5>
extern volatile __bit                   RF0PPS5             __at(0xF1C5);	// @ (0x1E38 * 8 + 5)
#define                                 RF0PPS5_bit         _BIT_ACCESS(RF0PPS,5)
// PORTF<RF1>
extern volatile __bit                   RF1                 __at(0x89);	// @ (0x11 * 8 + 1)
#define                                 RF1_bit             _BIT_ACCESS(PORTF,1)
// RF1PPS<RF1PPS0>
extern volatile __bit                   RF1PPS0             __at(0xF1C8);	// @ (0x1E39 * 8 + 0)
#define                                 RF1PPS0_bit         _BIT_ACCESS(RF1PPS,0)
// RF1PPS<RF1PPS1>
extern volatile __bit                   RF1PPS1             __at(0xF1C9);	// @ (0x1E39 * 8 + 1)
#define                                 RF1PPS1_bit         _BIT_ACCESS(RF1PPS,1)
// RF1PPS<RF1PPS2>
extern volatile __bit                   RF1PPS2             __at(0xF1CA);	// @ (0x1E39 * 8 + 2)
#define                                 RF1PPS2_bit         _BIT_ACCESS(RF1PPS,2)
// RF1PPS<RF1PPS3>
extern volatile __bit                   RF1PPS3             __at(0xF1CB);	// @ (0x1E39 * 8 + 3)
#define                                 RF1PPS3_bit         _BIT_ACCESS(RF1PPS,3)
// RF1PPS<RF1PPS4>
extern volatile __bit                   RF1PPS4             __at(0xF1CC);	// @ (0x1E39 * 8 + 4)
#define                                 RF1PPS4_bit         _BIT_ACCESS(RF1PPS,4)
// RF1PPS<RF1PPS5>
extern volatile __bit                   RF1PPS5             __at(0xF1CD);	// @ (0x1E39 * 8 + 5)
#define                                 RF1PPS5_bit         _BIT_ACCESS(RF1PPS,5)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// RF2PPS<RF2PPS0>
extern volatile __bit                   RF2PPS0             __at(0xF1D0);	// @ (0x1E3A * 8 + 0)
#define                                 RF2PPS0_bit         _BIT_ACCESS(RF2PPS,0)
// RF2PPS<RF2PPS1>
extern volatile __bit                   RF2PPS1             __at(0xF1D1);	// @ (0x1E3A * 8 + 1)
#define                                 RF2PPS1_bit         _BIT_ACCESS(RF2PPS,1)
// RF2PPS<RF2PPS2>
extern volatile __bit                   RF2PPS2             __at(0xF1D2);	// @ (0x1E3A * 8 + 2)
#define                                 RF2PPS2_bit         _BIT_ACCESS(RF2PPS,2)
// RF2PPS<RF2PPS3>
extern volatile __bit                   RF2PPS3             __at(0xF1D3);	// @ (0x1E3A * 8 + 3)
#define                                 RF2PPS3_bit         _BIT_ACCESS(RF2PPS,3)
// RF2PPS<RF2PPS4>
extern volatile __bit                   RF2PPS4             __at(0xF1D4);	// @ (0x1E3A * 8 + 4)
#define                                 RF2PPS4_bit         _BIT_ACCESS(RF2PPS,4)
// RF2PPS<RF2PPS5>
extern volatile __bit                   RF2PPS5             __at(0xF1D5);	// @ (0x1E3A * 8 + 5)
#define                                 RF2PPS5_bit         _BIT_ACCESS(RF2PPS,5)
// PORTF<RF3>
extern volatile __bit                   RF3                 __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// RF3PPS<RF3PPS0>
extern volatile __bit                   RF3PPS0             __at(0xF1D8);	// @ (0x1E3B * 8 + 0)
#define                                 RF3PPS0_bit         _BIT_ACCESS(RF3PPS,0)
// RF3PPS<RF3PPS1>
extern volatile __bit                   RF3PPS1             __at(0xF1D9);	// @ (0x1E3B * 8 + 1)
#define                                 RF3PPS1_bit         _BIT_ACCESS(RF3PPS,1)
// RF3PPS<RF3PPS2>
extern volatile __bit                   RF3PPS2             __at(0xF1DA);	// @ (0x1E3B * 8 + 2)
#define                                 RF3PPS2_bit         _BIT_ACCESS(RF3PPS,2)
// RF3PPS<RF3PPS3>
extern volatile __bit                   RF3PPS3             __at(0xF1DB);	// @ (0x1E3B * 8 + 3)
#define                                 RF3PPS3_bit         _BIT_ACCESS(RF3PPS,3)
// RF3PPS<RF3PPS4>
extern volatile __bit                   RF3PPS4             __at(0xF1DC);	// @ (0x1E3B * 8 + 4)
#define                                 RF3PPS4_bit         _BIT_ACCESS(RF3PPS,4)
// RF3PPS<RF3PPS5>
extern volatile __bit                   RF3PPS5             __at(0xF1DD);	// @ (0x1E3B * 8 + 5)
#define                                 RF3PPS5_bit         _BIT_ACCESS(RF3PPS,5)
// PORTF<RF4>
extern volatile __bit                   RF4                 __at(0x8C);	// @ (0x11 * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// RF4PPS<RF4PPS0>
extern volatile __bit                   RF4PPS0             __at(0xF1E0);	// @ (0x1E3C * 8 + 0)
#define                                 RF4PPS0_bit         _BIT_ACCESS(RF4PPS,0)
// RF4PPS<RF4PPS1>
extern volatile __bit                   RF4PPS1             __at(0xF1E1);	// @ (0x1E3C * 8 + 1)
#define                                 RF4PPS1_bit         _BIT_ACCESS(RF4PPS,1)
// RF4PPS<RF4PPS2>
extern volatile __bit                   RF4PPS2             __at(0xF1E2);	// @ (0x1E3C * 8 + 2)
#define                                 RF4PPS2_bit         _BIT_ACCESS(RF4PPS,2)
// RF4PPS<RF4PPS3>
extern volatile __bit                   RF4PPS3             __at(0xF1E3);	// @ (0x1E3C * 8 + 3)
#define                                 RF4PPS3_bit         _BIT_ACCESS(RF4PPS,3)
// RF4PPS<RF4PPS4>
extern volatile __bit                   RF4PPS4             __at(0xF1E4);	// @ (0x1E3C * 8 + 4)
#define                                 RF4PPS4_bit         _BIT_ACCESS(RF4PPS,4)
// RF4PPS<RF4PPS5>
extern volatile __bit                   RF4PPS5             __at(0xF1E5);	// @ (0x1E3C * 8 + 5)
#define                                 RF4PPS5_bit         _BIT_ACCESS(RF4PPS,5)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// RF5PPS<RF5PPS0>
extern volatile __bit                   RF5PPS0             __at(0xF1E8);	// @ (0x1E3D * 8 + 0)
#define                                 RF5PPS0_bit         _BIT_ACCESS(RF5PPS,0)
// RF5PPS<RF5PPS1>
extern volatile __bit                   RF5PPS1             __at(0xF1E9);	// @ (0x1E3D * 8 + 1)
#define                                 RF5PPS1_bit         _BIT_ACCESS(RF5PPS,1)
// RF5PPS<RF5PPS2>
extern volatile __bit                   RF5PPS2             __at(0xF1EA);	// @ (0x1E3D * 8 + 2)
#define                                 RF5PPS2_bit         _BIT_ACCESS(RF5PPS,2)
// RF5PPS<RF5PPS3>
extern volatile __bit                   RF5PPS3             __at(0xF1EB);	// @ (0x1E3D * 8 + 3)
#define                                 RF5PPS3_bit         _BIT_ACCESS(RF5PPS,3)
// RF5PPS<RF5PPS4>
extern volatile __bit                   RF5PPS4             __at(0xF1EC);	// @ (0x1E3D * 8 + 4)
#define                                 RF5PPS4_bit         _BIT_ACCESS(RF5PPS,4)
// RF5PPS<RF5PPS5>
extern volatile __bit                   RF5PPS5             __at(0xF1ED);	// @ (0x1E3D * 8 + 5)
#define                                 RF5PPS5_bit         _BIT_ACCESS(RF5PPS,5)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x8E);	// @ (0x11 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// RF6PPS<RF6PPS0>
extern volatile __bit                   RF6PPS0             __at(0xF1F0);	// @ (0x1E3E * 8 + 0)
#define                                 RF6PPS0_bit         _BIT_ACCESS(RF6PPS,0)
// RF6PPS<RF6PPS1>
extern volatile __bit                   RF6PPS1             __at(0xF1F1);	// @ (0x1E3E * 8 + 1)
#define                                 RF6PPS1_bit         _BIT_ACCESS(RF6PPS,1)
// RF6PPS<RF6PPS2>
extern volatile __bit                   RF6PPS2             __at(0xF1F2);	// @ (0x1E3E * 8 + 2)
#define                                 RF6PPS2_bit         _BIT_ACCESS(RF6PPS,2)
// RF6PPS<RF6PPS3>
extern volatile __bit                   RF6PPS3             __at(0xF1F3);	// @ (0x1E3E * 8 + 3)
#define                                 RF6PPS3_bit         _BIT_ACCESS(RF6PPS,3)
// RF6PPS<RF6PPS4>
extern volatile __bit                   RF6PPS4             __at(0xF1F4);	// @ (0x1E3E * 8 + 4)
#define                                 RF6PPS4_bit         _BIT_ACCESS(RF6PPS,4)
// RF6PPS<RF6PPS5>
