GopalSaraf/Practicals/PSDL/include/proc/pic16f19195.h
#define                                 S00C0_bit           _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<S00C1>
extern volatile __bit                   S00C1               __at(0xE8F0);	// @ (0x1D1E * 8 + 0)
#define                                 S00C1_bit           _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<S00C2>
extern volatile __bit                   S00C2               __at(0xE920);	// @ (0x1D24 * 8 + 0)
#define                                 S00C2_bit           _BIT_ACCESS(LCDDATA12,0)
// LCDDATA18<S00C3>
extern volatile __bit                   S00C3               __at(0xE950);	// @ (0x1D2A * 8 + 0)
#define                                 S00C3_bit           _BIT_ACCESS(LCDDATA18,0)
// LCDDATA24<S00C4>
extern volatile __bit                   S00C4               __at(0xE980);	// @ (0x1D30 * 8 + 0)
#define                                 S00C4_bit           _BIT_ACCESS(LCDDATA24,0)
// LCDDATA30<S00C5>
extern volatile __bit                   S00C5               __at(0xE9B0);	// @ (0x1D36 * 8 + 0)
#define                                 S00C5_bit           _BIT_ACCESS(LCDDATA30,0)
// LCDDATA36<S00C6>
extern volatile __bit                   S00C6               __at(0xE9E0);	// @ (0x1D3C * 8 + 0)
#define                                 S00C6_bit           _BIT_ACCESS(LCDDATA36,0)
// LCDDATA42<S00C7>
extern volatile __bit                   S00C7               __at(0xEA10);	// @ (0x1D42 * 8 + 0)
#define                                 S00C7_bit           _BIT_ACCESS(LCDDATA42,0)
// LCDDATA0<S01C0>
extern volatile __bit                   S01C0               __at(0xE8C1);	// @ (0x1D18 * 8 + 1)
#define                                 S01C0_bit           _BIT_ACCESS(LCDDATA0,1)
// LCDDATA6<S01C1>
extern volatile __bit                   S01C1               __at(0xE8F1);	// @ (0x1D1E * 8 + 1)
#define                                 S01C1_bit           _BIT_ACCESS(LCDDATA6,1)
// LCDDATA12<S01C2>
extern volatile __bit                   S01C2               __at(0xE921);	// @ (0x1D24 * 8 + 1)
#define                                 S01C2_bit           _BIT_ACCESS(LCDDATA12,1)
// LCDDATA18<S01C3>
extern volatile __bit                   S01C3               __at(0xE951);	// @ (0x1D2A * 8 + 1)
#define                                 S01C3_bit           _BIT_ACCESS(LCDDATA18,1)
// LCDDATA24<S01C4>
extern volatile __bit                   S01C4               __at(0xE981);	// @ (0x1D30 * 8 + 1)
#define                                 S01C4_bit           _BIT_ACCESS(LCDDATA24,1)
// LCDDATA30<S01C5>
extern volatile __bit                   S01C5               __at(0xE9B1);	// @ (0x1D36 * 8 + 1)
#define                                 S01C5_bit           _BIT_ACCESS(LCDDATA30,1)
// LCDDATA36<S01C6>
extern volatile __bit                   S01C6               __at(0xE9E1);	// @ (0x1D3C * 8 + 1)
#define                                 S01C6_bit           _BIT_ACCESS(LCDDATA36,1)
// LCDDATA42<S01C7>
extern volatile __bit                   S01C7               __at(0xEA11);	// @ (0x1D42 * 8 + 1)
#define                                 S01C7_bit           _BIT_ACCESS(LCDDATA42,1)
// LCDDATA0<S02C0>
extern volatile __bit                   S02C0               __at(0xE8C2);	// @ (0x1D18 * 8 + 2)
#define                                 S02C0_bit           _BIT_ACCESS(LCDDATA0,2)
// LCDDATA6<S02C1>
extern volatile __bit                   S02C1               __at(0xE8F2);	// @ (0x1D1E * 8 + 2)
#define                                 S02C1_bit           _BIT_ACCESS(LCDDATA6,2)
// LCDDATA12<S02C2>
extern volatile __bit                   S02C2               __at(0xE922);	// @ (0x1D24 * 8 + 2)
#define                                 S02C2_bit           _BIT_ACCESS(LCDDATA12,2)
// LCDDATA18<S02C3>
extern volatile __bit                   S02C3               __at(0xE952);	// @ (0x1D2A * 8 + 2)
#define                                 S02C3_bit           _BIT_ACCESS(LCDDATA18,2)
// LCDDATA24<S02C4>
extern volatile __bit                   S02C4               __at(0xE982);	// @ (0x1D30 * 8 + 2)
#define                                 S02C4_bit           _BIT_ACCESS(LCDDATA24,2)
// LCDDATA30<S02C5>
extern volatile __bit                   S02C5               __at(0xE9B2);	// @ (0x1D36 * 8 + 2)
#define                                 S02C5_bit           _BIT_ACCESS(LCDDATA30,2)
// LCDDATA36<S02C6>
extern volatile __bit                   S02C6               __at(0xE9E2);	// @ (0x1D3C * 8 + 2)
#define                                 S02C6_bit           _BIT_ACCESS(LCDDATA36,2)
// LCDDATA42<S02C7>
extern volatile __bit                   S02C7               __at(0xEA12);	// @ (0x1D42 * 8 + 2)
#define                                 S02C7_bit           _BIT_ACCESS(LCDDATA42,2)
// LCDDATA0<S03C0>
extern volatile __bit                   S03C0               __at(0xE8C3);	// @ (0x1D18 * 8 + 3)
#define                                 S03C0_bit           _BIT_ACCESS(LCDDATA0,3)
// LCDDATA6<S03C1>
extern volatile __bit                   S03C1               __at(0xE8F3);	// @ (0x1D1E * 8 + 3)
#define                                 S03C1_bit           _BIT_ACCESS(LCDDATA6,3)
// LCDDATA12<S03C2>
extern volatile __bit                   S03C2               __at(0xE923);	// @ (0x1D24 * 8 + 3)
#define                                 S03C2_bit           _BIT_ACCESS(LCDDATA12,3)
// LCDDATA18<S03C3>
extern volatile __bit                   S03C3               __at(0xE953);	// @ (0x1D2A * 8 + 3)
#define                                 S03C3_bit           _BIT_ACCESS(LCDDATA18,3)
// LCDDATA24<S03C4>
extern volatile __bit                   S03C4               __at(0xE983);	// @ (0x1D30 * 8 + 3)
#define                                 S03C4_bit           _BIT_ACCESS(LCDDATA24,3)
// LCDDATA30<S03C5>
extern volatile __bit                   S03C5               __at(0xE9B3);	// @ (0x1D36 * 8 + 3)
#define                                 S03C5_bit           _BIT_ACCESS(LCDDATA30,3)
// LCDDATA36<S03C6>
extern volatile __bit                   S03C6               __at(0xE9E3);	// @ (0x1D3C * 8 + 3)
#define                                 S03C6_bit           _BIT_ACCESS(LCDDATA36,3)
// LCDDATA42<S03C7>
extern volatile __bit                   S03C7               __at(0xEA13);	// @ (0x1D42 * 8 + 3)
#define                                 S03C7_bit           _BIT_ACCESS(LCDDATA42,3)
// LCDDATA0<S04C0>
extern volatile __bit                   S04C0               __at(0xE8C4);	// @ (0x1D18 * 8 + 4)
#define                                 S04C0_bit           _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<S04C1>
extern volatile __bit                   S04C1               __at(0xE8F4);	// @ (0x1D1E * 8 + 4)
#define                                 S04C1_bit           _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<S04C2>
extern volatile __bit                   S04C2               __at(0xE924);	// @ (0x1D24 * 8 + 4)
#define                                 S04C2_bit           _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<S04C3>
extern volatile __bit                   S04C3               __at(0xE954);	// @ (0x1D2A * 8 + 4)
#define                                 S04C3_bit           _BIT_ACCESS(LCDDATA18,4)
// LCDDATA24<S04C4>
extern volatile __bit                   S04C4               __at(0xE984);	// @ (0x1D30 * 8 + 4)
#define                                 S04C4_bit           _BIT_ACCESS(LCDDATA24,4)
// LCDDATA30<S04C5>
extern volatile __bit                   S04C5               __at(0xE9B4);	// @ (0x1D36 * 8 + 4)
#define                                 S04C5_bit           _BIT_ACCESS(LCDDATA30,4)
// LCDDATA36<S04C6>
extern volatile __bit                   S04C6               __at(0xE9E4);	// @ (0x1D3C * 8 + 4)
#define                                 S04C6_bit           _BIT_ACCESS(LCDDATA36,4)
// LCDDATA42<S04C7>
extern volatile __bit                   S04C7               __at(0xEA14);	// @ (0x1D42 * 8 + 4)
#define                                 S04C7_bit           _BIT_ACCESS(LCDDATA42,4)
// LCDDATA0<S05C0>
extern volatile __bit                   S05C0               __at(0xE8C5);	// @ (0x1D18 * 8 + 5)
#define                                 S05C0_bit           _BIT_ACCESS(LCDDATA0,5)
// LCDDATA6<S05C1>
extern volatile __bit                   S05C1               __at(0xE8F5);	// @ (0x1D1E * 8 + 5)
#define                                 S05C1_bit           _BIT_ACCESS(LCDDATA6,5)
// LCDDATA12<S05C2>
extern volatile __bit                   S05C2               __at(0xE925);	// @ (0x1D24 * 8 + 5)
#define                                 S05C2_bit           _BIT_ACCESS(LCDDATA12,5)
// LCDDATA18<S05C3>
extern volatile __bit                   S05C3               __at(0xE955);	// @ (0x1D2A * 8 + 5)
#define                                 S05C3_bit           _BIT_ACCESS(LCDDATA18,5)
// LCDDATA24<S05C4>
extern volatile __bit                   S05C4               __at(0xE985);	// @ (0x1D30 * 8 + 5)
#define                                 S05C4_bit           _BIT_ACCESS(LCDDATA24,5)
// LCDDATA30<S05C5>
extern volatile __bit                   S05C5               __at(0xE9B5);	// @ (0x1D36 * 8 + 5)
#define                                 S05C5_bit           _BIT_ACCESS(LCDDATA30,5)
// LCDDATA36<S05C6>
extern volatile __bit                   S05C6               __at(0xE9E5);	// @ (0x1D3C * 8 + 5)
#define                                 S05C6_bit           _BIT_ACCESS(LCDDATA36,5)
// LCDDATA42<S05C7>
extern volatile __bit                   S05C7               __at(0xEA15);	// @ (0x1D42 * 8 + 5)
#define                                 S05C7_bit           _BIT_ACCESS(LCDDATA42,5)
// LCDDATA0<S06C0>
extern volatile __bit                   S06C0               __at(0xE8C6);	// @ (0x1D18 * 8 + 6)
#define                                 S06C0_bit           _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<S06C1>
extern volatile __bit                   S06C1               __at(0xE8F6);	// @ (0x1D1E * 8 + 6)
#define                                 S06C1_bit           _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<S06C2>
extern volatile __bit                   S06C2               __at(0xE926);	// @ (0x1D24 * 8 + 6)
#define                                 S06C2_bit           _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<S06C3>
extern volatile __bit                   S06C3               __at(0xE956);	// @ (0x1D2A * 8 + 6)
#define                                 S06C3_bit           _BIT_ACCESS(LCDDATA18,6)
// LCDDATA24<S06C4>
extern volatile __bit                   S06C4               __at(0xE986);	// @ (0x1D30 * 8 + 6)
#define                                 S06C4_bit           _BIT_ACCESS(LCDDATA24,6)
// LCDDATA30<S06C5>
extern volatile __bit                   S06C5               __at(0xE9B6);	// @ (0x1D36 * 8 + 6)
#define                                 S06C5_bit           _BIT_ACCESS(LCDDATA30,6)
// LCDDATA36<S06C6>
extern volatile __bit                   S06C6               __at(0xE9E6);	// @ (0x1D3C * 8 + 6)
#define                                 S06C6_bit           _BIT_ACCESS(LCDDATA36,6)
// LCDDATA42<S06C7>
extern volatile __bit                   S06C7               __at(0xEA16);	// @ (0x1D42 * 8 + 6)
#define                                 S06C7_bit           _BIT_ACCESS(LCDDATA42,6)
// LCDDATA0<S07C0>
extern volatile __bit                   S07C0               __at(0xE8C7);	// @ (0x1D18 * 8 + 7)
#define                                 S07C0_bit           _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<S07C1>
extern volatile __bit                   S07C1               __at(0xE8F7);	// @ (0x1D1E * 8 + 7)
#define                                 S07C1_bit           _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<S07C2>
extern volatile __bit                   S07C2               __at(0xE927);	// @ (0x1D24 * 8 + 7)
#define                                 S07C2_bit           _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<S07C3>
extern volatile __bit                   S07C3               __at(0xE957);	// @ (0x1D2A * 8 + 7)
#define                                 S07C3_bit           _BIT_ACCESS(LCDDATA18,7)
// LCDDATA24<S07C4>
extern volatile __bit                   S07C4               __at(0xE987);	// @ (0x1D30 * 8 + 7)
#define                                 S07C4_bit           _BIT_ACCESS(LCDDATA24,7)
// LCDDATA30<S07C5>
extern volatile __bit                   S07C5               __at(0xE9B7);	// @ (0x1D36 * 8 + 7)
#define                                 S07C5_bit           _BIT_ACCESS(LCDDATA30,7)
// LCDDATA36<S07C6>
extern volatile __bit                   S07C6               __at(0xE9E7);	// @ (0x1D3C * 8 + 7)
#define                                 S07C6_bit           _BIT_ACCESS(LCDDATA36,7)
// LCDDATA42<S07C7>
extern volatile __bit                   S07C7               __at(0xEA17);	// @ (0x1D42 * 8 + 7)
#define                                 S07C7_bit           _BIT_ACCESS(LCDDATA42,7)
// LCDDATA1<S08C0>
extern volatile __bit                   S08C0               __at(0xE8C8);	// @ (0x1D19 * 8 + 0)
#define                                 S08C0_bit           _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<S08C1>
extern volatile __bit                   S08C1               __at(0xE8F8);	// @ (0x1D1F * 8 + 0)
#define                                 S08C1_bit           _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<S08C2>
extern volatile __bit                   S08C2               __at(0xE928);	// @ (0x1D25 * 8 + 0)
#define                                 S08C2_bit           _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<S08C3>
extern volatile __bit                   S08C3               __at(0xE958);	// @ (0x1D2B * 8 + 0)
#define                                 S08C3_bit           _BIT_ACCESS(LCDDATA19,0)
// LCDDATA25<S08C4>
extern volatile __bit                   S08C4               __at(0xE988);	// @ (0x1D31 * 8 + 0)
#define                                 S08C4_bit           _BIT_ACCESS(LCDDATA25,0)
// LCDDATA31<S08C5>
extern volatile __bit                   S08C5               __at(0xE9B8);	// @ (0x1D37 * 8 + 0)
#define                                 S08C5_bit           _BIT_ACCESS(LCDDATA31,0)
// LCDDATA37<S08C6>
extern volatile __bit                   S08C6               __at(0xE9E8);	// @ (0x1D3D * 8 + 0)
#define                                 S08C6_bit           _BIT_ACCESS(LCDDATA37,0)
// LCDDATA43<S08C7>
extern volatile __bit                   S08C7               __at(0xEA18);	// @ (0x1D43 * 8 + 0)
#define                                 S08C7_bit           _BIT_ACCESS(LCDDATA43,0)
// LCDDATA1<S09C0>
extern volatile __bit                   S09C0               __at(0xE8C9);	// @ (0x1D19 * 8 + 1)
#define                                 S09C0_bit           _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<S09C1>
extern volatile __bit                   S09C1               __at(0xE8F9);	// @ (0x1D1F * 8 + 1)
#define                                 S09C1_bit           _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<S09C2>
extern volatile __bit                   S09C2               __at(0xE929);	// @ (0x1D25 * 8 + 1)
#define                                 S09C2_bit           _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<S09C3>
extern volatile __bit                   S09C3               __at(0xE959);	// @ (0x1D2B * 8 + 1)
#define                                 S09C3_bit           _BIT_ACCESS(LCDDATA19,1)
// LCDDATA25<S09C4>
extern volatile __bit                   S09C4               __at(0xE989);	// @ (0x1D31 * 8 + 1)
#define                                 S09C4_bit           _BIT_ACCESS(LCDDATA25,1)
// LCDDATA31<S09C5>
extern volatile __bit                   S09C5               __at(0xE9B9);	// @ (0x1D37 * 8 + 1)
#define                                 S09C5_bit           _BIT_ACCESS(LCDDATA31,1)
// LCDDATA37<S09C6>
extern volatile __bit                   S09C6               __at(0xE9E9);	// @ (0x1D3D * 8 + 1)
#define                                 S09C6_bit           _BIT_ACCESS(LCDDATA37,1)
// LCDDATA43<S09C7>
extern volatile __bit                   S09C7               __at(0xEA19);	// @ (0x1D43 * 8 + 1)
#define                                 S09C7_bit           _BIT_ACCESS(LCDDATA43,1)
// LCDDATA1<S10C0>
extern volatile __bit                   S10C0               __at(0xE8CA);	// @ (0x1D19 * 8 + 2)
#define                                 S10C0_bit           _BIT_ACCESS(LCDDATA1,2)
// LCDDATA7<S10C1>
extern volatile __bit                   S10C1               __at(0xE8FA);	// @ (0x1D1F * 8 + 2)
#define                                 S10C1_bit           _BIT_ACCESS(LCDDATA7,2)
// LCDDATA13<S10C2>
extern volatile __bit                   S10C2               __at(0xE92A);	// @ (0x1D25 * 8 + 2)
#define                                 S10C2_bit           _BIT_ACCESS(LCDDATA13,2)
// LCDDATA19<S10C3>
extern volatile __bit                   S10C3               __at(0xE95A);	// @ (0x1D2B * 8 + 2)
#define                                 S10C3_bit           _BIT_ACCESS(LCDDATA19,2)
// LCDDATA25<S10C4>
extern volatile __bit                   S10C4               __at(0xE98A);	// @ (0x1D31 * 8 + 2)
#define                                 S10C4_bit           _BIT_ACCESS(LCDDATA25,2)
// LCDDATA31<S10C5>
extern volatile __bit                   S10C5               __at(0xE9BA);	// @ (0x1D37 * 8 + 2)
#define                                 S10C5_bit           _BIT_ACCESS(LCDDATA31,2)
// LCDDATA37<S10C6>
extern volatile __bit                   S10C6               __at(0xE9EA);	// @ (0x1D3D * 8 + 2)
#define                                 S10C6_bit           _BIT_ACCESS(LCDDATA37,2)
// LCDDATA43<S10C7>
extern volatile __bit                   S10C7               __at(0xEA1A);	// @ (0x1D43 * 8 + 2)
#define                                 S10C7_bit           _BIT_ACCESS(LCDDATA43,2)
// LCDDATA1<S11C0>
extern volatile __bit                   S11C0               __at(0xE8CB);	// @ (0x1D19 * 8 + 3)
#define                                 S11C0_bit           _BIT_ACCESS(LCDDATA1,3)
// LCDDATA7<S11C1>
extern volatile __bit                   S11C1               __at(0xE8FB);	// @ (0x1D1F * 8 + 3)
#define                                 S11C1_bit           _BIT_ACCESS(LCDDATA7,3)
// LCDDATA13<S11C2>
extern volatile __bit                   S11C2               __at(0xE92B);	// @ (0x1D25 * 8 + 3)
#define                                 S11C2_bit           _BIT_ACCESS(LCDDATA13,3)
// LCDDATA19<S11C3>
extern volatile __bit                   S11C3               __at(0xE95B);	// @ (0x1D2B * 8 + 3)
#define                                 S11C3_bit           _BIT_ACCESS(LCDDATA19,3)
// LCDDATA25<S11C4>
extern volatile __bit                   S11C4               __at(0xE98B);	// @ (0x1D31 * 8 + 3)
#define                                 S11C4_bit           _BIT_ACCESS(LCDDATA25,3)
// LCDDATA31<S11C5>
extern volatile __bit                   S11C5               __at(0xE9BB);	// @ (0x1D37 * 8 + 3)
#define                                 S11C5_bit           _BIT_ACCESS(LCDDATA31,3)
// LCDDATA37<S11C6>
extern volatile __bit                   S11C6               __at(0xE9EB);	// @ (0x1D3D * 8 + 3)
#define                                 S11C6_bit           _BIT_ACCESS(LCDDATA37,3)
// LCDDATA43<S11C7>
extern volatile __bit                   S11C7               __at(0xEA1B);	// @ (0x1D43 * 8 + 3)
#define                                 S11C7_bit           _BIT_ACCESS(LCDDATA43,3)
// LCDDATA1<S12C0>
extern volatile __bit                   S12C0               __at(0xE8CC);	// @ (0x1D19 * 8 + 4)
#define                                 S12C0_bit           _BIT_ACCESS(LCDDATA1,4)
// LCDDATA7<S12C1>
extern volatile __bit                   S12C1               __at(0xE8FC);	// @ (0x1D1F * 8 + 4)
#define                                 S12C1_bit           _BIT_ACCESS(LCDDATA7,4)
// LCDDATA13<S12C2>
extern volatile __bit                   S12C2               __at(0xE92C);	// @ (0x1D25 * 8 + 4)
#define                                 S12C2_bit           _BIT_ACCESS(LCDDATA13,4)
// LCDDATA19<S12C3>
extern volatile __bit                   S12C3               __at(0xE95C);	// @ (0x1D2B * 8 + 4)
#define                                 S12C3_bit           _BIT_ACCESS(LCDDATA19,4)
// LCDDATA25<S12C4>
extern volatile __bit                   S12C4               __at(0xE98C);	// @ (0x1D31 * 8 + 4)
#define                                 S12C4_bit           _BIT_ACCESS(LCDDATA25,4)
// LCDDATA31<S12C5>
extern volatile __bit                   S12C5               __at(0xE9BC);	// @ (0x1D37 * 8 + 4)
#define                                 S12C5_bit           _BIT_ACCESS(LCDDATA31,4)
// LCDDATA37<S12C6>
extern volatile __bit                   S12C6               __at(0xE9EC);	// @ (0x1D3D * 8 + 4)
#define                                 S12C6_bit           _BIT_ACCESS(LCDDATA37,4)
// LCDDATA43<S12C7>
extern volatile __bit                   S12C7               __at(0xEA1C);	// @ (0x1D43 * 8 + 4)
#define                                 S12C7_bit           _BIT_ACCESS(LCDDATA43,4)
// LCDDATA1<S13C0>
extern volatile __bit                   S13C0               __at(0xE8CD);	// @ (0x1D19 * 8 + 5)
#define                                 S13C0_bit           _BIT_ACCESS(LCDDATA1,5)
// LCDDATA7<S13C1>
extern volatile __bit                   S13C1               __at(0xE8FD);	// @ (0x1D1F * 8 + 5)
#define                                 S13C1_bit           _BIT_ACCESS(LCDDATA7,5)
// LCDDATA13<S13C2>
extern volatile __bit                   S13C2               __at(0xE92D);	// @ (0x1D25 * 8 + 5)
#define                                 S13C2_bit           _BIT_ACCESS(LCDDATA13,5)
// LCDDATA19<S13C3>
extern volatile __bit                   S13C3               __at(0xE95D);	// @ (0x1D2B * 8 + 5)
#define                                 S13C3_bit           _BIT_ACCESS(LCDDATA19,5)
// LCDDATA25<S13C4>
extern volatile __bit                   S13C4               __at(0xE98D);	// @ (0x1D31 * 8 + 5)
#define                                 S13C4_bit           _BIT_ACCESS(LCDDATA25,5)
// LCDDATA31<S13C5>
extern volatile __bit                   S13C5               __at(0xE9BD);	// @ (0x1D37 * 8 + 5)
#define                                 S13C5_bit           _BIT_ACCESS(LCDDATA31,5)
// LCDDATA37<S13C6>
extern volatile __bit                   S13C6               __at(0xE9ED);	// @ (0x1D3D * 8 + 5)
#define                                 S13C6_bit           _BIT_ACCESS(LCDDATA37,5)
// LCDDATA43<S13C7>
extern volatile __bit                   S13C7               __at(0xEA1D);	// @ (0x1D43 * 8 + 5)
#define                                 S13C7_bit           _BIT_ACCESS(LCDDATA43,5)
// LCDDATA1<S14C0>
extern volatile __bit                   S14C0               __at(0xE8CE);	// @ (0x1D19 * 8 + 6)
#define                                 S14C0_bit           _BIT_ACCESS(LCDDATA1,6)
// LCDDATA7<S14C1>
extern volatile __bit                   S14C1               __at(0xE8FE);	// @ (0x1D1F * 8 + 6)
#define                                 S14C1_bit           _BIT_ACCESS(LCDDATA7,6)
// LCDDATA13<S14C2>
extern volatile __bit                   S14C2               __at(0xE92E);	// @ (0x1D25 * 8 + 6)
#define                                 S14C2_bit           _BIT_ACCESS(LCDDATA13,6)
// LCDDATA19<S14C3>
extern volatile __bit                   S14C3               __at(0xE95E);	// @ (0x1D2B * 8 + 6)
#define                                 S14C3_bit           _BIT_ACCESS(LCDDATA19,6)
// LCDDATA25<S14C4>
extern volatile __bit                   S14C4               __at(0xE98E);	// @ (0x1D31 * 8 + 6)
#define                                 S14C4_bit           _BIT_ACCESS(LCDDATA25,6)
// LCDDATA31<S14C5>
extern volatile __bit                   S14C5               __at(0xE9BE);	// @ (0x1D37 * 8 + 6)
#define                                 S14C5_bit           _BIT_ACCESS(LCDDATA31,6)
// LCDDATA37<S14C6>
extern volatile __bit                   S14C6               __at(0xE9EE);	// @ (0x1D3D * 8 + 6)
#define                                 S14C6_bit           _BIT_ACCESS(LCDDATA37,6)
// LCDDATA43<S14C7>
extern volatile __bit                   S14C7               __at(0xEA1E);	// @ (0x1D43 * 8 + 6)
#define                                 S14C7_bit           _BIT_ACCESS(LCDDATA43,6)
// LCDDATA1<S15C0>
